doc/resources/benchmark_sysbench/threads24_sysbench-tpcc-noneproxy.txt
 date +%FT%TZ; \
> ./tpcc.lua --mysql-host=* --mysql-port=* --mysql-user=* --mysql-password=* \
> --mysql-db=sbt --report-interval=10 --tables=8 --scale=400 --db-driver=mysql --time=900 --threads=24 run; \
> date +%FT%TZ;
2020-04-27T05:56:50Z
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 24
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 24 tps: 370.13 qps: 10435.02 (r/w/o: 4752.54/4932.61/749.86) lat (ms,95%): 144.97 err/s 2.50 reconn/s: 0.00
[ 20s ] thds: 24 tps: 377.31 qps: 10599.26 (r/w/o: 4836.22/5008.42/754.62) lat (ms,95%): 130.13 err/s 0.90 reconn/s: 0.00
[ 30s ] thds: 24 tps: 381.50 qps: 10885.43 (r/w/o: 4955.51/5166.91/763.00) lat (ms,95%): 125.52 err/s 1.90 reconn/s: 0.00
[ 40s ] thds: 24 tps: 380.00 qps: 10863.33 (r/w/o: 4951.22/5152.12/760.00) lat (ms,95%): 121.08 err/s 1.70 reconn/s: 0.00
[ 50s ] thds: 24 tps: 384.60 qps: 10839.41 (r/w/o: 4944.30/5125.90/769.20) lat (ms,95%): 125.52 err/s 2.30 reconn/s: 0.00
[ 60s ] thds: 24 tps: 376.80 qps: 10639.26 (r/w/o: 4851.58/5034.08/753.60) lat (ms,95%): 137.35 err/s 1.80 reconn/s: 0.00
[ 70s ] thds: 24 tps: 379.10 qps: 10812.22 (r/w/o: 4923.06/5130.96/758.19) lat (ms,95%): 137.35 err/s 1.70 reconn/s: 0.00
[ 80s ] thds: 24 tps: 389.60 qps: 10920.23 (r/w/o: 4975.26/5165.76/779.21) lat (ms,95%): 121.08 err/s 1.70 reconn/s: 0.00
[ 90s ] thds: 24 tps: 381.00 qps: 10817.76 (r/w/o: 4924.38/5131.38/762.00) lat (ms,95%): 125.52 err/s 1.50 reconn/s: 0.00
[ 100s ] thds: 24 tps: 388.50 qps: 11077.25 (r/w/o: 5059.32/5240.92/777.00) lat (ms,95%): 121.08 err/s 1.70 reconn/s: 0.00
[ 110s ] thds: 24 tps: 374.29 qps: 10756.30 (r/w/o: 4906.41/5101.31/748.59) lat (ms,95%): 164.45 err/s 1.20 reconn/s: 0.00
[ 120s ] thds: 24 tps: 374.80 qps: 10689.07 (r/w/o: 4874.43/5065.03/749.61) lat (ms,95%): 144.97 err/s 0.80 reconn/s: 0.00
[ 130s ] thds: 24 tps: 376.00 qps: 10808.27 (r/w/o: 4945.23/5111.03/752.01) lat (ms,95%): 144.97 err/s 1.30 reconn/s: 0.00
[ 140s ] thds: 24 tps: 388.30 qps: 11067.99 (r/w/o: 5042.30/5249.10/776.60) lat (ms,95%): 123.28 err/s 1.40 reconn/s: 0.00
[ 150s ] thds: 24 tps: 378.70 qps: 10831.54 (r/w/o: 4946.72/5127.42/757.40) lat (ms,95%): 134.90 err/s 1.40 reconn/s: 0.00
[ 160s ] thds: 24 tps: 379.80 qps: 10825.99 (r/w/o: 4940.44/5125.94/759.61) lat (ms,95%): 153.02 err/s 0.90 reconn/s: 0.00
[ 170s ] thds: 24 tps: 389.60 qps: 11094.56 (r/w/o: 5055.14/5260.23/779.19) lat (ms,95%): 125.52 err/s 1.30 reconn/s: 0.00
[ 180s ] thds: 24 tps: 390.80 qps: 10840.46 (r/w/o: 4945.68/5113.18/781.60) lat (ms,95%): 125.52 err/s 2.30 reconn/s: 0.00
[ 190s ] thds: 24 tps: 362.70 qps: 10735.39 (r/w/o: 4903.20/5106.80/725.40) lat (ms,95%): 134.90 err/s 1.70 reconn/s: 0.00
[ 200s ] thds: 24 tps: 386.50 qps: 10753.40 (r/w/o: 4901.80/5078.60/773.00) lat (ms,95%): 125.52 err/s 1.60 reconn/s: 0.00
[ 210s ] thds: 24 tps: 374.60 qps: 10657.51 (r/w/o: 4858.16/5050.16/749.19) lat (ms,95%): 137.35 err/s 2.90 reconn/s: 0.00
[ 220s ] thds: 24 tps: 376.60 qps: 10720.40 (r/w/o: 4888.84/5078.35/753.21) lat (ms,95%): 147.61 err/s 2.00 reconn/s: 0.00
[ 230s ] thds: 24 tps: 375.10 qps: 10749.20 (r/w/o: 4901.60/5097.40/750.20) lat (ms,95%): 153.02 err/s 1.70 reconn/s: 0.00
[ 240s ] thds: 24 tps: 376.91 qps: 10830.07 (r/w/o: 4945.18/5131.08/753.81) lat (ms,95%): 127.81 err/s 1.80 reconn/s: 0.00
[ 250s ] thds: 24 tps: 365.10 qps: 10413.05 (r/w/o: 4758.08/4924.78/730.20) lat (ms,95%): 189.93 err/s 1.30 reconn/s: 0.00
[ 260s ] thds: 24 tps: 368.99 qps: 10430.74 (r/w/o: 4745.23/4947.52/737.99) lat (ms,95%): 186.54 err/s 1.00 reconn/s: 0.00
[ 270s ] thds: 24 tps: 386.40 qps: 11005.73 (r/w/o: 5020.47/5212.47/772.80) lat (ms,95%): 123.28 err/s 2.00 reconn/s: 0.00
[ 280s ] thds: 24 tps: 372.40 qps: 10506.82 (r/w/o: 4790.66/4971.36/744.81) lat (ms,95%): 132.49 err/s 1.20 reconn/s: 0.00
[ 290s ] thds: 24 tps: 382.10 qps: 10860.64 (r/w/o: 4954.32/5142.12/764.20) lat (ms,95%): 127.81 err/s 1.60 reconn/s: 0.00
[ 300s ] thds: 24 tps: 364.40 qps: 10344.70 (r/w/o: 4715.30/4900.60/728.80) lat (ms,95%): 183.21 err/s 2.30 reconn/s: 0.00
[ 310s ] thds: 24 tps: 358.30 qps: 10349.70 (r/w/o: 4718.50/4914.60/716.60) lat (ms,95%): 227.40 err/s 0.80 reconn/s: 0.00
[ 320s ] thds: 24 tps: 380.90 qps: 10794.72 (r/w/o: 4922.41/5110.51/761.80) lat (ms,95%): 132.49 err/s 2.00 reconn/s: 0.00
[ 330s ] thds: 24 tps: 365.50 qps: 10425.33 (r/w/o: 4763.22/4931.12/731.00) lat (ms,95%): 144.97 err/s 2.10 reconn/s: 0.00
[ 340s ] thds: 24 tps: 373.79 qps: 10549.92 (r/w/o: 4816.82/4986.22/746.89) lat (ms,95%): 134.90 err/s 1.50 reconn/s: 0.00
[ 350s ] thds: 24 tps: 375.00 qps: 10860.42 (r/w/o: 4949.15/5160.56/750.71) lat (ms,95%): 137.35 err/s 1.50 reconn/s: 0.00
[ 360s ] thds: 24 tps: 378.90 qps: 10833.36 (r/w/o: 4936.58/5138.98/757.80) lat (ms,95%): 134.90 err/s 2.50 reconn/s: 0.00
[ 370s ] thds: 24 tps: 375.00 qps: 10708.76 (r/w/o: 4887.53/5071.23/750.00) lat (ms,95%): 142.39 err/s 1.50 reconn/s: 0.00
[ 380s ] thds: 24 tps: 359.20 qps: 10276.24 (r/w/o: 4693.42/4864.42/718.40) lat (ms,95%): 193.38 err/s 2.30 reconn/s: 0.00
[ 390s ] thds: 24 tps: 377.50 qps: 10788.41 (r/w/o: 4922.76/5110.66/754.99) lat (ms,95%): 130.13 err/s 1.90 reconn/s: 0.00
[ 400s ] thds: 24 tps: 374.40 qps: 10433.40 (r/w/o: 4762.80/4921.80/748.80) lat (ms,95%): 211.60 err/s 1.20 reconn/s: 0.00
[ 410s ] thds: 24 tps: 385.60 qps: 10761.79 (r/w/o: 4904.20/5086.40/771.20) lat (ms,95%): 137.35 err/s 1.20 reconn/s: 0.00
[ 420s ] thds: 24 tps: 363.50 qps: 10495.58 (r/w/o: 4795.64/4972.94/727.01) lat (ms,95%): 235.74 err/s 1.50 reconn/s: 0.00
[ 430s ] thds: 24 tps: 374.90 qps: 10600.66 (r/w/o: 4836.78/5014.08/749.80) lat (ms,95%): 147.61 err/s 1.10 reconn/s: 0.00
[ 440s ] thds: 24 tps: 366.29 qps: 10483.05 (r/w/o: 4784.03/4966.43/732.59) lat (ms,95%): 144.97 err/s 2.40 reconn/s: 0.00
[ 450s ] thds: 24 tps: 378.81 qps: 10823.37 (r/w/o: 4940.18/5125.58/757.61) lat (ms,95%): 134.90 err/s 1.90 reconn/s: 0.00
[ 460s ] thds: 24 tps: 379.70 qps: 10629.66 (r/w/o: 4849.73/5020.53/759.40) lat (ms,95%): 137.35 err/s 1.70 reconn/s: 0.00
[ 470s ] thds: 24 tps: 371.70 qps: 10537.91 (r/w/o: 4805.71/4988.81/743.40) lat (ms,95%): 150.29 err/s 1.10 reconn/s: 0.00
[ 480s ] thds: 24 tps: 372.29 qps: 10517.31 (r/w/o: 4797.21/4975.51/744.59) lat (ms,95%): 170.48 err/s 1.60 reconn/s: 0.00
[ 490s ] thds: 24 tps: 380.30 qps: 10820.44 (r/w/o: 4933.52/5126.32/760.60) lat (ms,95%): 130.13 err/s 0.90 reconn/s: 0.00
[ 500s ] thds: 24 tps: 371.90 qps: 10700.39 (r/w/o: 4873.54/5083.04/743.81) lat (ms,95%): 132.49 err/s 2.90 reconn/s: 0.00
[ 510s ] thds: 24 tps: 380.70 qps: 10531.57 (r/w/o: 4806.79/4963.39/761.40) lat (ms,95%): 132.49 err/s 1.70 reconn/s: 0.00
[ 520s ] thds: 24 tps: 356.50 qps: 10243.35 (r/w/o: 4676.82/4853.52/713.00) lat (ms,95%): 164.45 err/s 1.50 reconn/s: 0.00
[ 530s ] thds: 24 tps: 369.60 qps: 10516.59 (r/w/o: 4789.75/4987.65/739.19) lat (ms,95%): 176.73 err/s 1.80 reconn/s: 0.00
[ 540s ] thds: 24 tps: 372.70 qps: 10430.17 (r/w/o: 4757.23/4927.53/745.41) lat (ms,95%): 147.61 err/s 1.80 reconn/s: 0.00
[ 550s ] thds: 24 tps: 371.30 qps: 10771.14 (r/w/o: 4915.37/5113.17/742.60) lat (ms,95%): 137.35 err/s 1.90 reconn/s: 0.00
[ 560s ] thds: 24 tps: 361.50 qps: 10256.74 (r/w/o: 4681.22/4852.52/723.00) lat (ms,95%): 223.34 err/s 1.00 reconn/s: 0.00
[ 570s ] thds: 24 tps: 372.10 qps: 10485.94 (r/w/o: 4781.27/4960.47/744.20) lat (ms,95%): 150.29 err/s 1.30 reconn/s: 0.00
[ 580s ] thds: 24 tps: 373.40 qps: 11116.79 (r/w/o: 5069.74/5300.24/746.81) lat (ms,95%): 139.85 err/s 1.70 reconn/s: 0.00
[ 590s ] thds: 24 tps: 373.10 qps: 10729.64 (r/w/o: 4888.27/5095.17/746.20) lat (ms,95%): 153.02 err/s 2.30 reconn/s: 0.00
[ 600s ] thds: 24 tps: 373.70 qps: 10448.82 (r/w/o: 4763.45/4937.96/747.41) lat (ms,95%): 144.97 err/s 1.50 reconn/s: 0.00
[ 610s ] thds: 24 tps: 367.10 qps: 10631.27 (r/w/o: 4850.48/5046.58/734.20) lat (ms,95%): 142.39 err/s 1.40 reconn/s: 0.00
[ 620s ] thds: 24 tps: 383.10 qps: 10830.82 (r/w/o: 4941.61/5123.01/766.20) lat (ms,95%): 132.49 err/s 1.50 reconn/s: 0.00
[ 630s ] thds: 24 tps: 370.40 qps: 10300.71 (r/w/o: 4697.66/4862.56/740.49) lat (ms,95%): 193.38 err/s 2.20 reconn/s: 0.00
[ 640s ] thds: 24 tps: 378.20 qps: 10930.26 (r/w/o: 4987.53/5186.03/756.70) lat (ms,95%): 132.49 err/s 1.30 reconn/s: 0.00
[ 650s ] thds: 24 tps: 389.70 qps: 10891.29 (r/w/o: 4973.65/5138.25/779.39) lat (ms,95%): 127.81 err/s 2.30 reconn/s: 0.00
[ 660s ] thds: 24 tps: 378.80 qps: 10499.63 (r/w/o: 4794.41/4947.62/757.60) lat (ms,95%): 153.02 err/s 1.50 reconn/s: 0.00
[ 670s ] thds: 24 tps: 370.40 qps: 10705.36 (r/w/o: 4882.83/5081.73/740.80) lat (ms,95%): 147.61 err/s 1.60 reconn/s: 0.00
[ 680s ] thds: 24 tps: 380.00 qps: 10751.21 (r/w/o: 4913.25/5077.95/760.01) lat (ms,95%): 127.81 err/s 2.30 reconn/s: 0.00
[ 690s ] thds: 24 tps: 359.49 qps: 10346.65 (r/w/o: 4726.33/4901.33/718.99) lat (ms,95%): 227.40 err/s 1.70 reconn/s: 0.00
[ 700s ] thds: 24 tps: 378.90 qps: 10693.58 (r/w/o: 4872.74/5063.04/757.81) lat (ms,95%): 139.85 err/s 1.70 reconn/s: 0.00
[ 710s ] thds: 24 tps: 374.70 qps: 10552.58 (r/w/o: 4808.69/4994.49/749.40) lat (ms,95%): 179.94 err/s 1.60 reconn/s: 0.00
[ 720s ] thds: 24 tps: 391.10 qps: 11228.99 (r/w/o: 5119.19/5328.29/781.50) lat (ms,95%): 123.28 err/s 2.50 reconn/s: 0.00
[ 730s ] thds: 24 tps: 388.30 qps: 10982.31 (r/w/o: 5017.66/5187.36/777.29) lat (ms,95%): 134.90 err/s 1.60 reconn/s: 0.00
[ 740s ] thds: 24 tps: 385.10 qps: 10973.10 (r/w/o: 5008.65/5194.15/770.31) lat (ms,95%): 137.35 err/s 1.10 reconn/s: 0.00
[ 750s ] thds: 24 tps: 385.69 qps: 10954.00 (r/w/o: 4994.11/5188.61/771.29) lat (ms,95%): 137.35 err/s 0.90 reconn/s: 0.00
[ 760s ] thds: 24 tps: 384.50 qps: 10932.53 (r/w/o: 4998.51/5165.12/768.90) lat (ms,95%): 164.45 err/s 1.30 reconn/s: 0.00
[ 770s ] thds: 24 tps: 392.40 qps: 11139.20 (r/w/o: 5074.50/5279.80/784.90) lat (ms,95%): 137.35 err/s 1.50 reconn/s: 0.00
[ 780s ] thds: 24 tps: 375.11 qps: 10821.92 (r/w/o: 4944.20/5127.50/750.22) lat (ms,95%): 137.35 err/s 1.60 reconn/s: 0.00
[ 790s ] thds: 24 tps: 396.39 qps: 11061.62 (r/w/o: 5047.22/5221.62/792.79) lat (ms,95%): 137.35 err/s 2.40 reconn/s: 0.00
[ 800s ] thds: 24 tps: 384.10 qps: 11150.61 (r/w/o: 5088.80/5293.81/768.00) lat (ms,95%): 132.49 err/s 1.30 reconn/s: 0.00
[ 810s ] thds: 24 tps: 390.90 qps: 11353.27 (r/w/o: 5179.63/5391.63/782.01) lat (ms,95%): 125.52 err/s 1.90 reconn/s: 0.00
[ 820s ] thds: 24 tps: 385.80 qps: 11046.26 (r/w/o: 5038.88/5235.78/771.60) lat (ms,95%): 173.58 err/s 1.50 reconn/s: 0.00
[ 830s ] thds: 24 tps: 383.50 qps: 10757.51 (r/w/o: 4901.10/5089.40/767.00) lat (ms,95%): 176.73 err/s 1.80 reconn/s: 0.00
[ 840s ] thds: 24 tps: 379.10 qps: 10895.14 (r/w/o: 4963.82/5173.12/758.20) lat (ms,95%): 132.49 err/s 1.00 reconn/s: 0.00
[ 850s ] thds: 24 tps: 377.10 qps: 10744.69 (r/w/o: 4901.15/5089.35/754.19) lat (ms,95%): 170.48 err/s 1.30 reconn/s: 0.00
[ 860s ] thds: 24 tps: 389.11 qps: 10983.35 (r/w/o: 5010.87/5194.27/778.21) lat (ms,95%): 134.90 err/s 1.40 reconn/s: 0.00
[ 870s ] thds: 24 tps: 379.50 qps: 10641.63 (r/w/o: 4854.11/5028.51/759.00) lat (ms,95%): 147.61 err/s 1.90 reconn/s: 0.00
[ 880s ] thds: 24 tps: 399.80 qps: 11050.21 (r/w/o: 5030.21/5220.41/799.60) lat (ms,95%): 125.52 err/s 1.40 reconn/s: 0.00
[ 890s ] thds: 24 tps: 397.10 qps: 11219.16 (r/w/o: 5120.98/5303.98/794.20) lat (ms,95%): 118.92 err/s 1.40 reconn/s: 0.00
[ 900s ] thds: 24 tps: 404.70 qps: 11594.43 (r/w/o: 5285.97/5499.07/809.40) lat (ms,95%): 125.52 err/s 1.70 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            4412794
        write:                           4580946
        other:                           680538
        total:                           9674278
    transactions:                        340233 (377.94 per sec.)
    queries:                             9674278 (10746.54 per sec.)
    ignored errors:                      1481   (1.65 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          900.2211s
    total number of events:              340233

Latency (ms):
         min:                                    1.45
         avg:                                   63.49
         max:                                  601.71
         95th percentile:                      137.35
         sum:                             21600453.47

Threads fairness:
    events (avg/stddev):           14176.3750/105.76
    execution time (avg/stddev):   900.0189/0.06

2020-04-27T06:11:50Z